tap "oven-sh/bun"
brew "atuin"
brew "awscli"
brew "bat"
brew "chezmoi"
brew "curlie"
brew "fx"
brew "fzf"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "gitleaks"
brew "glow"
brew "go"
brew "gum"
brew "htop"
brew "kondo"
brew "ncdu"
brew "node"
brew "oras"
brew "pandoc"
brew "pnpm"
brew "pre-commit"
brew "ripgrep"
brew "ruff"
brew "rustup"
brew "starship"
brew "tmux"
brew "trash"
brew "typescript"
brew "uutils-coreutils"
brew "uv"
brew "yq"
brew "yubico-piv-tool"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "oven-sh/bun/bun"
cask "anki"
cask "bitwarden"
cask "claude"
cask "docker-desktop"
cask "espanso"
cask "figma"
cask "ghostty"
cask "microsoft-edge"
cask "microsoft-excel"
cask "microsoft-onenote"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "nordvpn"
cask "obsidian"
cask "onedrive"
cask "pearcleaner"
cask "scroll-reverser"
cask "spotify"
cask "steam"
cask "temurin"
cask "visual-studio-code"
cask "windows-app"
cask "yubico-authenticator"
vscode "anthropic.claude-code"
vscode "bierner.markdown-mermaid"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "davidanson.vscode-markdownlint"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "jinliming2.vscode-go-template"
vscode "jnoortheen.nix-ide"
vscode "ms-vscode-remote.remote-containers"
vscode "myriad-dreamin.tinymist"
vscode "redhat.vscode-yaml"
vscode "svelte.svelte-vscode"
vscode "tyriar.sort-lines"
go "golang.org/x/tools/gopls"
