# Taps
tap "oven-sh/bun"
tap "withgraphite/tap"

# CLI tools
brew "atuin"
brew "awscli"
brew "bat"
brew "beads"
brew "chezmoi"
brew "curlie"
brew "fx"
brew "fzf"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "gitleaks"
brew "go"
brew "gum"
brew "htop"
brew "jtbl"
brew "kondo"
brew "ncdu"
brew "openssh"
brew "oras"
brew "pandoc"
brew "pre-commit"
brew "ripgrep"
brew "rust"
brew "starship"
brew "tmux"
brew "trash"
brew "uutils-coreutils"
brew "uv"
brew "yq"
brew "yubico-piv-tool"
brew "zoxide"
brew "zsh-syntax-highlighting"
brew "oven-sh/bun/bun"
brew "withgraphite/tap/graphite"

# Applications
cask "anki"
cask "bitwarden"
cask "claude"
cask "docker-desktop"
cask "espanso"
cask "figma"
cask "ghostty"
cask "logi-options+"
cask "microsoft-edge"
cask "microsoft-excel"
cask "microsoft-onenote"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "nordvpn"
cask "obsidian"
cask "onedrive"
cask "pearcleaner"
cask "spotify"
cask "steam"
cask "temurin"
cask "visual-studio-code"
cask "whatsapp"
cask "windows-app"
cask "yubico-authenticator"

# VS Code extensions
vscode "42crunch.vscode-openapi"
vscode "anthropic.claude-code"
vscode "arjun.swagger-viewer"
vscode "attilabuti.vscode-mjml"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "codeque.codeque"
vscode "cpylua.language-postcss"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "humao.rest-client"
vscode "jebbs.plantuml"
vscode "jock.svg"
vscode "ms-azuretools.vscode-containers"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "nrwl.angular-console"
vscode "prisma.prisma"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "rust-lang.rust-analyzer"
vscode "ryuta46.multi-command"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "tomoki1207.pdf"
vscode "tyriar.sort-lines"
vscode "vscodevim.vim"
vscode "william-voyek.vscode-nginx"
vscode "yzhang.markdown-all-in-one"

# Go tools
go "golang.org/x/tools/gopls"
